#Область СлужебныйПрограммныйИнтерфейс

// Функция: СложитьЧисла
//
// Синтаксис:
//  Сумма = СложитьЧисла(<Число1>, <Число2>)
//
// Параметры:
//  Число1 - Число - Первое слагаемое.
//  Число2 - Число - Второе слагаемое.
//
// Возвращаемое значение:
//  Число - Арифметическая сумма двух чисел.
//
// Описание:
//  Производит арифметическое сложение двух числовых значений.
//  Используется для демонстрации принципов документирования кода.
//
// Пример:
//  Результат = СложитьЧисла(5, 3); // Вернет 8
//
Функция СложитьЧисла(Число1, Число2) Экспорт

	Возврат Число1 + Число2;
	
КонецФункции 

// Функция: ТестированиеSonar
//
// Синтаксис:
//  ТестированиеSonar()
//
// Возвращаемое значение:
//  Булево - Признак прохождения проверки. 
//
// Для выполнения домашнего задания
//
Функция ТестированиеSonar() Экспорт
	
	Переменная = СложитьЧисла(1, 1);   
	ПравильныйОтвет = 2;
	
	Если Переменная = ПравильныйОтвет Тогда 		
		ПроверкаПройдена = Истина;		 		
	Иначе		
		ПроверкаПройдена = Ложь; 		
	КонецЕсли;
	
	Возврат ПроверкаПройдена;

КонецФункции 

#КонецОбласти