#Область СлужебныйПрограммныйИнтерфейс

// Функция: СложитьЧисла
//
// Синтаксис:
//  Сумма = СложитьЧисла(<Число1>, <Число2>)
//
// Параметры:
//  Число1 - Число - Первое слагаемое.
//  Число2 - Число - Второе слагаемое.
//
// Возвращаемое значение:
//  Число - Арифметическая сумма двух чисел.
//
// Описание:
//  Производит арифметическое сложение двух числовых значений.
//  Используется для демонстрации принципов документирования кода.
//
// Пример:
//  Результат = СложитьЧисла(5, 3); // Вернет 8
//
Функция СложитьЧисла(Число1, Число2) Экспорт

	Возврат Число1 + Число2;
	
КонецФункции 

// Процедура: ТестированиеSonar
//
// Синтаксис:
//  ТестированиеSonar()
//
// Для выполнения домашнего задания
//
Процедура ТестированиеSonar() Экспорт
	
	// Комментарийбезпробелов
	НоваяСтрока = "Это очень длинная строка. Это очень длинная строка. Это очень длинная строка. Это очень длинная строка. Это очень длинная строка. Это очень длинная строка. Это очень длинная строка. Это очень длинная строка.";	
	
	Переменная = СложитьЧисла(1, 1);
	
	Если Переменная = 2 Тогда 
		
		ПроверкаПройдена = Истина;
		
	ИначеЕсли Переменная <> 2 Тогда
		
		ПроверкаПройдена = Ложь;

	КонецЕсли;

КонецПроцедуры 

#КонецОбласти